/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   examples.c                                         :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: agottlie <agottlie@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/01/20 13:21:22 by agottlie          #+#    #+#             */
/*   Updated: 2019/01/23 08:28:09 by agottlie         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <stdio.h>

int		main(void)
{
	/*	==================== ФЛАГИ ==================== */
	printf("\n============= FLAGS \n");
	/* минимальная ширина 2. Ширина числа больше 2, поэтому вывод полного значения */
	printf("  %%2d\t\t=\t'%2d'\n", 123);			//	'123'
	/* минимальная ширина 6. Ширина числа меньше 6, поэтому вывод значения
	** сопровождается пробелами перед числом */
	printf("  %%6d\t\t=\t'%6d'\n", 123);			//	'   123'
	/* флаг -; минимальная ширина 6. Флаг '-' выравнивает значение по левому краю */
	printf("  %%-6d\t\t=\t'%-6d'\n", 123);			//	'123   '
	/* флаг +; минимальная ширина 6. Флаг '+' всегда показывает знак для
	** десятичного числового значения (в том числе знак плюс) */
	printf("  %%+6d\t\t=\t'%+6d'\n", 123);			//	'  +123'
	/* флаг 0; минимальная ширина 6. Если минимальная ширина больше ширины значения
	** флаг '0' дополнит недостоющие места перед значением 0 */
	printf("  %%06d\t\t=\t'%06d'\n", 123);			//	'000123'
	/* флаг пробел. Ставит пробел перед значением если первый символ не знак */
	printf("  %% d\t\t=\t'% d'\n", 123);			//	' 123'
	/* флаг пробел. Здесь есть знак, поэтому нет пробела. Пробел игнорируется */
	printf("  %% d\t\t=\t'% d'\n", -123);			//	'-123'
	/* флаг пробел. Здесь есть знак, поэтому нет пробела. Пробел игнорируется */
	printf("  %%+ d\t\t=\t'%+ d'\n", 123);			//	'+123'

	/* ==================== МОДИФИКАТОР ШИРИНЫ ==================== */
	printf("\n============= WIDTH \n");
	/* Модификатор *; флаг +. Указывает минимальную ширину поля (включая знак для чисел) */
	printf("  %%*d\t\t=\t'%*d'\n", 6, 123);			//	'   123'
	printf("  %%+*d\t\t=\t'%+*d'\n", 6, 123);		//	'  +123'
	/* Модификатор *; флаг +, 0. Поставит плюс и нулю перед числом. Расположение нуля
	** и плюса не имеет значения */
	printf("  %%+0*d\t\t=\t'%+0*d'\n", 6, 123);		//	'+00123'
	printf("  %%0+*d\t\t=\t'%0+*d'\n", 6, 123);		//	'+00123'

	/* ==================== МОДИФИКАТОР РАЗМЕРА ==================== */
	printf("\n============= SIZE \n");



	/* ==================== ПОДВОДНЫЕ КАМНИ ==================== */
	printf("\n============= PITFALLS \n");
	/* При превышении кол-ва аргументов будет выведен мусор */
	printf("  %d, %d, %d, %d\n", 6, 123);		//	'6, 123, trash, trash'
	/* При недостаче аргументов они выведены не будут */
	printf("  %d, %d\n", 6, 123, 10, 43);		//	'6, 123, trash, trash'
	/* Много знаков точности не влияют на исход */
	printf("%.........................5d", 32);	//	'00032'


	return (0);
}